# Скачаем образ python, если он ещё не скачан
FROM python:3.11.1  

# Создание папки booking
RUN mkdir /booking

# Задать рабочу дирректорию и перейти в неё
WORKDIR /booking

# Скопировать файл с зависимостями в наш образ, Докер закеширует этот файл и библиотеки будут за мгновение браться из кеша
COPY requirements.txt .

# Установить все библиотеки из файла с зависимостями 
RUN pip install -r requirements.txt

# Скопировать весь остальной код из нашей папки в папку докер, если что-то в коде изменится, этот шаг будет выполняться повторно при сборке образа
COPY . . 

# Разрешить запуск скрипта с определенными правами
RUN chmod a+x /booking/docker/app.sh

# Команда, которая будет выполнена при запуске контейнера
CMD ["gunicorn", "app.main:app", "--workers", "1", "--worker-class", "uvicorn.workers.UvicornWorker", "--bind=0.0.0.0:8000"]
